	#pragma once
//==========================================================================================
	// частота шины I2C, при использовании DS1307 выставлять не более 100 кГц
	#define	I2C_FREQUENCY 						200000UL
	#define I2C_TWBR 							(((F_CPU / I2C_FREQUENCY) - 16UL ) / 2UL)
//==========================================================================================
	// инициализация I2C модуля
	void I2C_Init();

	// отправка стоповой посылки
	uint8_t I2C_Start(uint8_t address);

	// отправка стоповой посылки
	void I2C_Stop();

	// отправка байта данных по I2C
	uint8_t I2C_SendByte(uint8_t data);

	// прием байта данных по I2C (с ACK)
	uint8_t I2C_ReceiveByteACK();

	// прием последнего байта по I2C (без ACK)
	uint8_t I2C_ReceiveByteNACK();

